#pragma once

struct AttackInfo;

//===========================================================
// 1回だけ有効な球形の攻撃判定
//===========================================================
class AttackHitBox : public KdGameObject
{
public:

	//===========================================================
	// コンストラクタ・デストラクタ
	//===========================================================
	AttackHitBox(
		const Math::Vector3&	pos,
		float					radius,
		const AttackInfo&		attackInfo
	);
	~AttackHitBox()		override;

	//===========================================================
	// 基本ライフサイクル
	//===========================================================
	void PostUpdate()	override;

private:

	//===========================================================
	// 所有・参照するオブジェクト
	//===========================================================
	std::unique_ptr<AttackInfo>		m_upAttackInfo = nullptr;

	//===========================================================
	// 状態値
	//===========================================================
	int				m_life		= 1;
	Math::Vector3	m_pos		= Math::Vector3::Zero;
	float			m_radius	= 0.0f;
};