#pragma once

//===========================================================
// カメラからロックオンできる対象の共通機能
//===========================================================
class ILockOnTarget
{
public:

	//===========================================================
	// コンストラクタ・デストラクタ
	//===========================================================
	ILockOnTarget()				= default;
	virtual ~ILockOnTarget()	= default;

	//===========================================================
	// 公開関数群
	//===========================================================
	// 現在ロックオンできる状態か
	virtual bool CanLockOn() const = 0;

	// カメラが狙う位置を返す
	virtual Math::Vector3 GetLockOnPosition() const = 0;
};